Revit 2027 API
Schema.ReadAccessGranted Method
 Checks whether Entities of this Schema may be retrieved by the current add-in.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReadAccessGranted()
Public Function ReadAccessGranted As Boolean
public:
bool ReadAccessGranted()
member ReadAccessGranted : unit -> bool
Return Value
Boolean
 True if read access is allowed.
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace